yt11dev.СК/src/Reports/СК_ОтчетФактСклад_v2/СК_ОтчетФактСклад_v2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>СК_ОтчетФактСклад_v2</name>
</mdclass:Report>

yt11dev.СК/src/AccumulationRegisters/СК_ТоварыНаСкладах/СК_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СК_ТоварыНаСкладах</name>
  <resources>
    <name>Вналичии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.СК_Ячейки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

yt11dev.СК/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fe779ac1-0e7f-489c-ad06-bec9af582428">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="d561ee5a-2a87-4205-93af-4902b1247d87">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="75e2d606-c8d4-4cfe-8f96-2eaa5c364409">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/InformationRegisters/ЦеныНоменклатуры25/ЦеныНоменклатуры25.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="60ff2f20-cb36-4ee2-aad8-4bd0327df594">
  <name>ЦеныНоменклатуры25</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="94221289-05e8-493f-b0bb-038570ca2c7d">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="73cfd776-be9d-497c-b1cf-50a4de2dd8c4">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="b05ccc6e-8f9f-4ca0-ab35-15ac0e0299d5">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

yt11dev.СК/src/Reports/СК_ОтчетФактСклад_v2/ObjectModule.bsl
#Область ОписаниеПеременных

Перем ДатаНачала,ДатаОкончания,Период;

#КонецОбласти  

Процедура ПередЗагрузкойВариантаНаСервере(ЭтаФорма, НовыеНастройкиКД) Экспорт
	Отчет = ЭтаФорма.Отчет;
	КомпоновщикНастроекФормы = Отчет.КомпоновщикНастроек;
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроекФормы, Истина);
	
	НовыеНастройкиКД = КомпоновщикНастроекФормы.Настройки;   
	
КонецПроцедуры 

Процедура УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы) 
	//ПараметрДатаНачала = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДатаНачала");  
	//ПараметрДатаНачала.Использование = Истина; 
	////ПараметрДатаНачала.Значение.Дата = НачалоДня(ТекущаяДата()) - 86400*30;
	////ТДата = НачалоДня(ТекущаяДата()) - 86400*10;
	//Если ТипЗнч(ПараметрДатаНачала.Значение) <> Тип("Дата")  Тогда
	// 	Если ПараметрДатаНачала.Значение.Дата = Дата(1,1,1) Тогда
	//		ПараметрДатаНачала.Значение.Дата = НачалоДня(ТекущаяДата()) - 86400*30; 
	//	КонецЕсли;
	//КонецЕсли;
	
	//Иначе
	//	ПараметрДатаНачала.Значение.Дата = ПараметрДатаНачала.Значение;	
	//КонецЕсли;
	//ПараметрДатаОкончания = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ДатаОкончания");  
	//ПараметрДатаОкончания.Использование = Истина; 
	//Если ТипЗнч(ПараметрДатаОкончания.Значение) <> Тип("Дата")  Тогда
	//	Если ПараметрДатаОкончания.Значение.Дата = Дата(1,1,1) Тогда
	//		ПараметрДатаОкончания.Значение.Дата = ТекущаяДата(); 
	//	КонецЕсли;
	//Иначе
	//	ПараметрДатаОкончания.Значение.Дата = ПараметрДатаОкончания.Значение;	
	//КонецЕсли;
	
	
	
КонецПроцедуры

#Область ОбработчикиСобытий
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка) 
	//ДатаНачала = ТекущаяДата()-180*86400;
	//ДатаОкончания = ТекущаяДата();
	СтандартнаяОбработка = Ложь;
	ПользовательскиеНастройкиМодифицированы = Ложь;
	
	УстановитьОбязательныеНастройки(КомпоновщикНастроек, ПользовательскиеНастройкиМодифицированы);
	
	//
	//// Подготовим и выведем отчет.
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	//
	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	//	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновкиДанных, ДанныеРасшифровки);
	//	
	//КомпоновкаДанныхСервер.УстановитьЗаголовкиМакетаКомпоновки(СтруктураЗаголовковПолей(), МакетКомпоновки);
	//
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	//
	//ПериодОтчета = ОтчетыУТКлиентСервер.ГраницаРасчета(КомпоновщикНастроек, ПоляОтбора.Период);
	ТабСервис = НаборСервис();
		//
	ВнешниеНаборыДанных = Новый Структура("ТабСервис", ТабСервис);
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки, Истина);

	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.НачатьВывод();
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
	ПроцессорВывода.ЗакончитьВывод();
	
	

КонецПроцедуры    
#КонецОбласти 


Функция НаборСервис()  

	ВидЦены = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ВидЦены").Значение; 
	Период = КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "Период").Значение;;//КомпоновкаДанныхКлиентСервер.ПолучитьПараметр(КомпоновщикНастроек, "ЦенаРозница").Значение; 
	
	
	Таб = Новый ТаблицаЗначений; 
	Таб.Колонки.Добавить("Номенклатура");
	Таб.Колонки.Добавить("ВналичииОстатокТСД");
	Таб.Колонки.Добавить("ВНаличииОстатокСклад");
	Таб.Колонки.Добавить("Ячейка");
	Таб.Колонки.Добавить("ШтрихКодЯчейка"); 
	Таб.Колонки.Добавить("ШтрихкодНоменклатура");
	Таб.Колонки.Добавить("Цена");
	Таб.Колонки.Добавить("СуммаТСД");
	Таб.Колонки.Добавить("СуммаУчет");

	Запрос = Новый Запрос;
	Запрос.Текст  ="ВЫБРАТЬ
	               |	СК_ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура
	               |ПОМЕСТИТЬ ВТЗ
	               |ИЗ
	               |	РегистрНакопления.СК_ТоварыНаСкладах.Остатки(&Период, ) КАК СК_ТоварыНаСкладахОстатки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ТоварыНаСкладахОстатки.Номенклатура
	               |ИЗ
	               |	РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТЗ.Номенклатура КАК Номенклатура,
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	               |	ЦеныНоменклатуры25СрезПоследних.Цена КАК Цена
	               |ПОМЕСТИТЬ ВТЗноменклатура
	               |ИЗ
	               |	ВТЗ КАК ВТЗ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |		ПО (ШтрихкодыНоменклатуры.Номенклатура = ВТЗ.Номенклатура)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних(&Период, ) КАК ЦеныНоменклатуры25СрезПоследних
	               |		ПО (ЦеныНоменклатуры25СрезПоследних.Номенклатура = ВТЗ.Номенклатура)
	               |ГДЕ
	               |	ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦены
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТЗноменклатура.Номенклатура КАК Номенклатура,
	               |	ВТЗноменклатура.Штрихкод КАК Штрихкод,
	               |	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
	               |	СУММА(ВТЗноменклатура.Цена) КАК Цена
	               |ПОМЕСТИТЬ ВТЗСклад
	               |ИЗ
	               |	ВТЗноменклатура КАК ВТЗноменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(&Период, ) КАК ТоварыНаСкладахОстатки
	               |		ПО (ТоварыНаСкладахОстатки.Номенклатура = ВТЗноменклатура.Номенклатура)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТЗноменклатура.Номенклатура,
	               |	ВТЗноменклатура.Штрихкод,
	               |	ТоварыНаСкладахОстатки.ВНаличииОстаток
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТЗСклад.Номенклатура КАК Номенклатура,
	               |	ВТЗСклад.Штрихкод КАК ШтрихкодНоменклатура,
	               |	ЕСТЬNULL(ВТЗСклад.ВНаличииОстаток, 0) КАК ВНаличииОстатокСклад,
	               |	ЕСТЬNULL(ВТЗСклад.Цена, 0) КАК Цена,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка КАК Ячейка,
	               |	СК_ТоварыНаСкладахОстатки.Ячейка.ШтрихКод КАК ШтрихКодЯчейка,
	               |	ЕСТЬNULL(СК_ТоварыНаСкладахОстатки.ВналичииОстаток, 0) КАК ВналичииОстатокТСД,
	               |	ЕСТЬNULL(ВТЗСклад.Цена, 0) * ЕСТЬNULL(СК_ТоварыНаСкладахОстатки.ВналичииОстаток, 0) КАК СуммаТСД,
	               |	ЕСТЬNULL(ВТЗСклад.Цена, 0) * ЕСТЬNULL(ВТЗСклад.ВНаличииОстаток, 0) КАК СуммаУчет
	               |ИЗ
	               |	ВТЗСклад КАК ВТЗСклад
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СК_ТоварыНаСкладах.Остатки КАК СК_ТоварыНаСкладахОстатки
	               |		ПО ВТЗСклад.Номенклатура = СК_ТоварыНаСкладахОстатки.Номенклатура
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура"; 
	Запрос.УстановитьПараметр("ВидЦены",ВидЦены);  
	Запрос.УстановитьПараметр("Период",КонецДня(Период.Дата));  
 
	Таб = Запрос.Выполнить().Выгрузить(); 
	Таб.Колонки.Добавить("Ссылка");
	
	ТабНомСсылки = Таб.ВыгрузитьКолонку(0);
	ТабДвижений = ТаблицаДвижений(Таб.ВыгрузитьКолонку(0));
	
	Для Каждого стр из Таб Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура",стр.Номенклатура);
		Строки = ТабДвижений.НайтиСтроки(Отбор);
		Если Строки.Количество()>=1 Тогда
			стр.Ссылка = Строки[0].Регистратор;
		КонецЕсли;
	КонецЦикла;
	
	//
	Возврат Таб;	
КонецФункции   

Функция ТаблицаДвижений(Ном)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
|	Номенклатура.Ссылка КАК Ссылка
|ПОМЕСТИТЬ ВТЗНоменклатуры
|ИЗ
|	Справочник.Номенклатура КАК Номенклатура
|ГДЕ
|	Номенклатура.Ссылка В(&Ссылка)
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ РАЗЛИЧНЫЕ
|	ТоварыНаСкладах.Период КАК Период,
|	ТоварыНаСкладах.Номенклатура КАК Номенклатура,
|	ТоварыНаСкладах.Регистратор КАК Регистратор
|ИЗ
|	ВТЗНоменклатуры КАК ВТЗНоменклатуры
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах КАК ТоварыНаСкладах
|		ПО (ВТЗНоменклатуры.Ссылка = ТоварыНаСкладах.Номенклатура)
|
|СГРУППИРОВАТЬ ПО
|	ТоварыНаСкладах.Период,
|	ТоварыНаСкладах.Номенклатура,
|	ТоварыНаСкладах.Регистратор
|
|УПОРЯДОЧИТЬ ПО
|	Период УБЫВ";
	
	Запрос.УстановитьПараметр("Ссылка",Ном); 
	
	Таб = Запрос.Выполнить().Выгрузить();
	
	Возврат Таб;
	
Конецфункции



Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительныйОтчет();
    ПараметрыРегистрации.БезопасныйРежим = Ложь;
    ПараметрыРегистрации.Версия = "1.3";
	
	Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = 'Отклонение перерасчетов'");
    Команда.Идентификатор = "Отклонение перерасчетов";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
    Команда.ПоказыватьОповещение = Ложь;
	
    Возврат ПараметрыРегистрации;
	
КонецФункции
